 $(document).ready(function() {
        var waterContentOfFood = {
            "米饭": 0.71,
            "大米粥": 0.88,
            "面条(煮)": 0.73,
            "馒头": 0.4,
            "花卷": 0.46,
            "烧饼": 0.26,
            "油饼": 0.25,
            "包子": 0.53,
            "水饺": 0.55,
            "蛋糕": 0.19,
            "饼干": 0.06,
            "面包": 0.27,
            "油条": 0.22,
            "馄饨": 0.59,
            "鸡/鸭蛋": 0.74,
            "牛奶": 0.84,
            "豆浆": 0.96,
            "牛肉": 0.7,
            "猪肉": 0.55,
            "羊肉": 0.73,
            "鱼虾蟹": 0.77,
            "鸡肉": 0.7,
            "豆腐脑": 0.97,
            "豆腐": 0.83,
            "鲜青菜/菌藻": 0.95 ,
            "土豆": 0.8,
            "坚果": 0.03,
            "板栗": 0.55,
            "西瓜": 0.93,
            "梨类": 0.86,
            "李子": 0.9,
            "樱桃": 0.88,
            "苹果": 0.86,
            "橘子/柑橘": 0.87,
            "火龙果": 0.84,
            "葡萄": 0.89,
            "桃子": 0.89,
            "香蕉": 0.77,
            "草莓": 0.91,
            "菠萝": 0.88,
            "黄瓜": 0.96,
            "西红柿": 0.94,
        };

        var select = $('.food_type');

        $.each(waterContentOfFood, function(key, val) {
            console.log(key + val)
            var option = $('<option>').val(key).text(key);
            select.append(option);
        })

});